# Задача 18: Требуется найти в массиве A[1..N] самый близкий по 
# величине элемент к заданному числу X. Пользователь в первой 
# строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка 
# содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     6
#     -> 5

import random

lengthArray = int(input("Задайте длину массива: "))
n = int (input("Массив состоит из натуральных чисел 1..N. Ведите натуральное число N: "))
x = int (input("Введите число x: "))
listNumber = []                            # создаем пустой массив
for i in range(lengthArray):               # цикл выполняется в зависимости от длины массива раз
    listNumber.append(random.randint(1,n))         # наш массив заполняется рандомным перебором от 1 до n
print(listNumber)                          # вывод нашего массива на экран

closest = listNumber[0]                    # closest хранит ближайший к числу X элемент
difference = abs(listNumber[0] - x)        # difference - разница между X и ближайшим элементом по модулю

for i in listNumber:                       # в цикле проверяем разницу между каждым элементом и числом X. 
    if abs(i - x) < difference:            # Если разница разница меньше предыдущей, то  
        difference = abs(i - x)            
        closest = i                        # присваиваем переменной closest значение проверяемого элемента
print(f'Ближайшее к числу X = {x} число в массиве {closest}')